app/controllers/produtos_controller.rb

    def index
        @produtos = Produto.order(nome: :desc)
        @produto_com_desconto = Produto.order(:preco).limit 1
---
SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."nome" DESC
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 1]]

    def create
        produto = params.require(:produto).permit(:nome, :descricao, :preco, :quantidade)
        Produto.create produto
---
INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Caneta"], ["descricao", "Azul"], ["preco", 2.0], ["quantidade", 100], ["created_at", "2018-09-20 13:13:58.416857"], ["updated_at", "2018-09-20 13:13:58.416857"]]

    def destroy
        id = params[:id]
        Produto.destroy id
---
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 2]]

    def busca
        @nome = params[:nome]
        @produtos = Produto.where "nome like ?", "%#{@nome}%"
---
SELECT "produtos".* FROM "produtos" WHERE (nome like '%tv%')